docs/leets/1110-Delete-Nodes-And-Return-Forest.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1110. Delete Nodes And Return Forest</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-16
</div>
<div id="content" class="content">
<header>
<h1 class="title">1110. Delete Nodes And Return Forest</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><p>
<b><b>Links</b></b>
</p>
<ul class="org-ul">
<li><a href="https://leetcode.com/submissions/detail/1323699890/">Submission</a></li>
</ul>

<p>
<b><b>Problem:</b></b>
</p>

<p>
Given the `root` of a binary tree, each node in the tree has a distinct value. After deleting certain nodes, we need to return the forest (a collection of trees). Each node in the tree that needs to be deleted will be included in an array `to<sub>delete</sub>`.
</p>

<p>
We need to:
</p>
<ul class="org-ul">
<li>Delete the nodes listed in `to<sub>delete</sub>`</li>
<li>Return the remaining trees in the forest.</li>
</ul>

<p>
<b><b>Solution Description:</b></b>
</p>

<p>
To implement the problem we need to perform the following steps:
</p>
<ol class="org-ol">
<li>Perform a Depth-First Search (DFS) on the tree.</li>
<li>If a node needs to be deleted, recursively call the function on its children and add those children to the forest (if they are not null).</li>
<li>For each node, check if it's in the `to<sub>delete</sub>` list. If it is, mark it for deletion and set its parent's reference to it to `null`.</li>
<li>Keep a record of all roots of trees that are not marked for deletion and return them at the end.</li>
</ol>

<p>
Time Complexity:
</p>
<ul class="org-ul">
<li>Each node is visited once, resulting in O(N) time complexity, where N is the number of nodes in the tree.</li>
</ul>

<p>
Space Complexity:
</p>
<ul class="org-ul">
<li>In the worst case scenario, the recursion stack can go as deep as the height of the tree (O(H)), but since we store the nodes in to<sub>delete</sub> in a set and the result in a list, the space complexity is O(N).</li>
</ul>

<p>
<b><b>Example:</b></b>
</p>

<p>
Consider this binary tree:
</p>

<pre class="example" id="orga44a621">
    1
   / \
  2   3
 / \ / \
4  5 6  7
</pre>

<p>
If the `to<sub>delete</sub>` list is [3, 5], the forest after deletion would be:
</p>

<pre class="example" id="orgda2e386">
1     6
/ \
2  4  7
</pre>

<p>
<b><b>Setup:</b></b>
</p>

<p>
We will define the `mainSolution` function to perform the DFS traversal for deleting the nodes and then recording the forest. We will also include a test setup to validate the implementation.
</p>

<p>
<b><b>Test Execution:</b></b>
</p>

<p>
The testing framework will display input parameters, the actual result, the expected result, and whether the test passed or failed for each test case.
</p>

<p>
<b><b>Implementation:</b></b>
</p>

<div class="org-src-container">
<pre class="src src-js">// Helper functions for logging and debugging (no-op if NestedInteger is defined)

/**
 * Main solution function that performs tree manipulation
 * @param {TreeNode} root - The root of the binary tree
 * @param {number[]} to_delete - List of node values to be deleted
 * @return {TreeNode[]} - Forest of remaining trees
 */
function mainSolution(root, to_delete) {
    const toDeleteSet = new Set(to_delete);
    const forest = [];

    function dfs(node, isRoot) {
        if (!node) return null;

        const shouldDelete = toDeleteSet.has(node.val);
        if (isRoot &amp;&amp; !shouldDelete) {
            forest.push(node);
        }

        node.left = dfs(node.left, shouldDelete);
        node.right = dfs(node.right, shouldDelete);

        return shouldDelete ? null : node;
    }

    dfs(root, true);
    return forest;
}

// Definition for a binary tree node.
class TreeNode {
    constructor(val = 0, left = null, right = null) {
        this.val = val;
        this.left = left;
        this.right = right;
    }
}

// Test cases
const testCases = [
    {
        root: new TreeNode(1,
            new TreeNode(2, new TreeNode(4), new TreeNode(5)),
            new TreeNode(3, new TreeNode(6), new TreeNode(7))
        ),
        to_delete: [3, 5],
        expected: [ [1, 2, 4], [6], [7] ]
    },
    {
        root: new TreeNode(1, new TreeNode(2), new TreeNode(3)),
        to_delete: [1],
        expected: [[2], [3]],
    },
    {
        root: new TreeNode(1, new TreeNode(2, new TreeNode(4), new TreeNode(3)), new TreeNode(5)),
        to_delete: [2, 3],
        expected: [[1, 5], [4]],
    },
    {
        root: new TreeNode(1, new TreeNode(2, null, new TreeNode(3)), null),
        to_delete: [2],
        expected: [[1], [3]],
    },
    {
        root: new TreeNode(1, null, new TreeNode(2, new TreeNode(3), new TreeNode(4))),
        to_delete: [2],
        expected: [[1], [3], [4]],
    }
];

// Execute test cases
testCases.forEach((test, index) =&gt; {
    const result = mainSolution(test.root, test.to_delete);
    const resultFormatted = result.map(tree =&gt; flatten(tree));
    console.log(`Test Case ${index + 1}: ${arraysEqual(resultFormatted, test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(resultFormatted)})`);
});

/**
 * Function to flatten a tree to an array
 * @param {TreeNode} node - The root node of the tree to flatten
 * @return {number[]} - Flattened tree as array
 */
function flatten(node) {
    if (!node) return [];
    return [node.val, ...flatten(node.left), ...flatten(node.right)];
}

/**
 * Function to check if two nested arrays are equal
 * @param {Array} a - First array
 * @param {Array} b - Second array
 * @return {boolean} - True if arrays are equal, false otherwise
 */
function arraysEqual(a, b) {
    if (a.length !== b.length) return false;
    for (let i = 0; i &lt; a.length; i++) {
        if (Array.isArray(a[i]) &amp;&amp; Array.isArray(b[i])) {
            if (!arraysEqual(a[i], b[i])) return false;
        } else if (a[i] !== b[i]) {
            return false;
        }
    }
    return true;
}
</pre>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
